# AllRefs Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Connector..::..AllRefs Property
Connector Class See Also
---
All references of the connector.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ConnectorSet AllRefs { get; }
```

Visual Basic
---
```text
Public ReadOnly Property AllRefs As ConnectorSet
	Get
```

Visual C++
---
```text
public:
property ConnectorSet^ AllRefs {
	ConnectorSet^ get ();
}
```

# Remarks
A set of connectors that the connectors is connected to, including both physical connection and logical connection.
# See Also
Connector Class
Autodesk.Revit.DB Namespace